app/controllers/goals_controller.rb

INSERT INTO "goals" ("created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-03 22:05:28.022618"], ["description", "A difficult goal"], ["title", ""], ["updated_at", "2014-11-03 22:05:28.022618"], ["user_id", 2]]
---
  def create
    @goal = Goal.new(goal_params)
    @goal.user_id = current_user.id
    if @goal.save